In [1]:
import pandas as pd

In [2]:
test = pd.read_csv("user.csv")

In [3]:
test.head()

,nric_id,name,country,email,phone,type,password,membership_id,points,points_redeemed,expiry,tier
0,704-82-5692,Dolf Suche,Indonesia,dsuche0@privacy.gov.au,(443) 8839479,non-member,jGuGsghl6h0,346756782,8939,19274,3/18/2019,bronze
1,324-71-4176,Noni Fahy,China,nfahy1@samsung.com,(873) 9662928,non-member,fyh7zFsbnHs,8991479111,7833,18676,2/4/2020,gold
2,805-70-1459,Joshuah Holme,China,jholme2@ucoz.com,(864) 4142998,non-member,YDEGMjQ1,7238360381,28548,22428,7/6/2019,gold
3,248-61-7593,Gerrie Aleavy,Japan,galeavy3@dailymotion.com,(422) 7481206,non-member,9DJQbDfuAh3,9491129961,36989,15256,10/6/2018,silver
4,237-06-9226,Kinna Pauer,Ukraine,kpauer4@topsy.com,(394) 7905151,non-member,r4nnfxaA,2012443885,12837,3495,11/28/2018,silver

### Creating Schedule

In [4]:
flight = pd.read_csv("flight.csv")

In [5]:
flight.drop_duplicates(subset=['schedule_id', 'arrival_airport', 'arrival_datetime', 'depart_airport', 'depart_datetime']).head()

,schedule_id,arrival_airport,arrival_datetime,depart_airport,depart_datetime,price,flight_id,manufacturer,model,capacity
0,6931010700,Ukraine,6/28/2020,Sweden,9/22/2019,2083,JH4NA21615S154843,boeing,3,20
1,8959052388,China,7/1/2020,Indonesia,9/6/2019,2977,1G6DH5E58D0852309,airbus,3,20
2,8347380848,China,4/27/2020,Indonesia,10/27/2018,2538,3VW507AT0EM958189,airbus,1,20
3,1012056228,Indonesia,3/15/2020,Azerbaijan,2/5/2019,1103,WBASN0C52DD599576,airbus,2,20
4,857875906,Indonesia,3/11/2019,Russia,11/28/2018,2437,1C4RDJEG0DC687380,airbus,1,20

In [7]:
!pip install mysql-connector-python-rf

Collecting mysql-connector-python-rf
  Downloading https://files.pythonhosted.org/packages/21/79/2ff01ab7aa08db3a16b70b990c579c1024c6b2a734263cc7513a758867de/mysql-connector-python-rf-2.2.2.tar.gz (11.9MB)
    100% |████████████████████████████████| 11.9MB 1.4MB/s ta 0:00:011
Building wheels for collected packages: mysql-connector-python-rf
  Running setup.py bdist_wheel for mysql-connector-python-rf ... done
  Stored in directory: /Users/tankaiwei/Library/Caches/pip/wheels/87/58/fb/d95c84fad7e1bebfed324c13e107ebb08e1997c9226532859a
Successfully built mysql-connector-python-rf
Installing collected packages: mysql-connector-python-rf
Successfully installed mysql-connector-python-rf-2.2.2
You are using pip version 18.1, however version 19.2.3 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [1]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='chenkaiwei',
                              host='localhost',
                              database='test')

In [2]:
query = ("SELECT * FROM user")
cursor = cnx.cursor()

cursor.execute(query)

for (first_name, last_name) in cursor:
  print("{}, {} was hired".format(
    last_name, first_name))

test, 123 was hired
test, 123 was hired

In [55]:
query

'SELECT * FROM user'

In [30]:
#creating string of 1A to 5D
seats_col = ['a', 'b', 'c', 'd']
seats_id = []

for each in range(5):
    for letter in seats_col:
        seats_id.append(str(each + 1) + letter)

In [34]:
flight.head()

,schedule_id,arrival_airport,arrival_datetime,depart_airport,depart_datetime,price,flight_id,manufacturer,model,capacity
0,6931010700,Ukraine,6/28/2020,Sweden,9/22/2019,2083,JH4NA21615S154843,boeing,3,20
1,8959052388,China,7/1/2020,Indonesia,9/6/2019,2977,1G6DH5E58D0852309,airbus,3,20
2,8347380848,China,4/27/2020,Indonesia,10/27/2018,2538,3VW507AT0EM958189,airbus,1,20
3,1012056228,Indonesia,3/15/2020,Azerbaijan,2/5/2019,1103,WBASN0C52DD599576,airbus,2,20
4,857875906,Indonesia,3/11/2019,Russia,11/28/2018,2437,1C4RDJEG0DC687380,airbus,1,20

## Processing table

In [3]:
import query

In [4]:
drop = query.create_table

In [5]:
for each in drop:
    cursor.execute(drop)

for each in test:
    print(each)
    cursor.execute(each)

create table membership(
    membership_id bigint,
    points int,
    points_redeemed int,
    expiry date,
    tier varchar(256),
    primary key (membership_id)
);

ProgrammingError: 1050 (42S01): Table 'membership' already exists